app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(:product => product)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ?  ORDER BY title LIMIT 1  [["id", 8]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-07-28 02:31:35.436918"], ["updated_at", "2015-07-28 02:31:35.436918"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 8], ["cart_id", 1], ["created_at", "2015-07-27 16:12:52.929198"], ["updated_at", "2015-07-27 16:12:52.929198"]]